Repository: vmassuchetto/python-cobol-server
Catalog: locales/*/LC_MESSAGES/cobolapi.po
Languages: pt_br

source: print this help message
pt_br: imprime esta mensagem de ajuda

source: operation name: %s
pt_br: nome da operação: %s

source: (required)
pt_br: (obrigatorio)

source: path to the copybook file
pt_br: caminho para o arquivo copybook

source: path to the datafile
pt_br: caminho para o arquivo de dados

source: comma separated list of keys
pt_br: lista de chaves separada por virgulas

source: put the main key first and the alternate keys last
pt_br: coloque a chave principal antes e as chaves alternadas depois

source: key to use in operation
pt_br: chave para usar nesta operacao

source: value to match the key
pt_br: valor para comparar com a chave

source: input JSON object for the operation
pt_br: objeto JSON de entrada para a operacao

source: check the README.md file for examples
pt_br: verifique o arquivo README.md para exemplos

source: Partial search options
pt_br: Opcoes para busca parcial

source: super key in case of doing a partial search
pt_br: superchave em caso de busca parcial

source: part of --keyname in the --superkeyname as a [start:end] format
pt_br: parte de --keyname em --superkeyname no formato [inicio:fim]

source: of how to use partial key searches
pt_br: de como usar buscas parciais

source: ERROR: No arguments provided.
pt_br: ERRO: Nenhum argumento fornecido.

source: ERROR: --operation option required.
pt_br: ERRO: opcao --operation obrigatoria.

source: ERROR: Supported operations: %s.
pt_br: ERRO: Operacoes suportadas: %s.

source: ERROR: Required options: %s.
pt_br: ERRO: Opcoes obrigatorias: %s

source: ERROR: Invalid file in --%s option.
pt_br: ERRO: Arquivo invalido na opcao --%s.

source: ERROR: --keyname and --keyvalue required for operation %s.
pt_br: ERRO: --keyname e --keyvalue sao obrigatorios para a operacao %s

source: ERROR: Could not parse JSON object input.
pt_br: ERRO: Nao foi possivel analisar o objeto JSON de entrada.

source: ERROR: Invalid fields: %s.
pt_br: ERRO: Campos invalidos: %s.

source: ERROR: Superkey not in the copybook.
pt_br: ERRO: Superchave nao esta no copybook

source: ERROR: --superkeypart required for partial key searches.
pt_br: ERRO: --superkeypart obrigatorio para buscas parciais de chave.

source: ERROR: File keys "%s" must be provided in --input.
pt_br: ERRO: Chaves de arquivo "%s" devem ser fornecidas no --input.

source: ERROR: Could not read the file %s.
pt_br: ERRO: Nao foi possivel ler o arquivo %s.

source: ERROR: Could not write to the file %s.
pt_br: ERRO: Nao foi possivel escrever no arquivo %s.

source: ERROR: Template tags not binded: %s.
pt_br: ERRO: Tags de template nao vinculadas: %s

source: ERROR: Compilation failed: %s.
pt_br: ERRO: Falha de compilacao: %s

source: ERROR: --input value required for %s operation.
pt_br: ERRO: Valor --input e obrigatorio para a operacao %s.
